MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/NUC505YO13Y/mcu.h
#define UART_LINCTL_PID_Pos              (24)                                              /*!< UART_T::LINCTL: PID Position              */
#define UART_LINCTL_PID_Msk              (0xfful << UART_LINCTL_PID_Pos)                   /*!< UART_T::LINCTL: PID Mask                  */

#define UART_LINSTS_SLVHDETF_Pos         (0)                                               /*!< UART_T::LINSTS: SLVHDETF Position         */
#define UART_LINSTS_SLVHDETF_Msk         (0x1ul << UART_LINSTS_SLVHDETF_Pos)               /*!< UART_T::LINSTS: SLVHDETF Mask             */

#define UART_LINSTS_SLVHEF_Pos           (1)                                               /*!< UART_T::LINSTS: SLVHEF Position           */
#define UART_LINSTS_SLVHEF_Msk           (0x1ul << UART_LINSTS_SLVHEF_Pos)                 /*!< UART_T::LINSTS: SLVHEF Mask               */

#define UART_LINSTS_SLVIDPEF_Pos         (2)                                               /*!< UART_T::LINSTS: SLVIDPEF Position         */
#define UART_LINSTS_SLVIDPEF_Msk         (0x1ul << UART_LINSTS_SLVIDPEF_Pos)               /*!< UART_T::LINSTS: SLVIDPEF Mask             */

#define UART_LINSTS_SLVSYNCF_Pos         (3)                                               /*!< UART_T::LINSTS: SLVSYNCF Position         */
#define UART_LINSTS_SLVSYNCF_Msk         (0x1ul << UART_LINSTS_SLVSYNCF_Pos)               /*!< UART_T::LINSTS: SLVSYNCF Mask             */

#define UART_LINSTS_BRKDETF_Pos          (8)                                               /*!< UART_T::LINSTS: BRKDETF Position          */
#define UART_LINSTS_BRKDETF_Msk          (0x1ul << UART_LINSTS_BRKDETF_Pos)                /*!< UART_T::LINSTS: BRKDETF Mask              */

#define UART_LINSTS_BITEF_Pos            (9)                                               /*!< UART_T::LINSTS: BITEF Position            */
#define UART_LINSTS_BITEF_Msk            (0x1ul << UART_LINSTS_BITEF_Pos)                  /*!< UART_T::LINSTS: BITEF Mask                */

/**@}*/ /* UART_CONST */
/**@}*/ /* end of UART register group */


/*---------------------- USB Device Controller -------------------------*/
/**
    @addtogroup USBD USB Device Controller(USBD)
    Memory Mapped Structure for USBD Controller
@{ */

typedef struct
{

    union
    {

        /**
         * EPxDAT
         * ===================================================================================================
         * Offset: 0x64+x*0x28   Endpoint x Data Register
         * ---------------------------------------------------------------------------------------------------
         * |Bits    |Field     |Descriptions
         * | :----: | :----:   | :---- |
         * |[31:0]  |EPDAT     |Endpoint A~L Data Register
         * |        |          |Endpoint A~L data buffer for the buffer transaction (read or write).
         * |        |          |Only word or byte access are supported.
        */
        __IO uint32_t EPDAT;
        /**
           * EPxDAT_BYTE
           * ===================================================================================================
           * Offset: 0x64+x*0x28   Endpoint x Data Register for Byte Access
           * ---------------------------------------------------------------------------------------------------
           * |Bits    |Field     |Descriptions
           * | :----: | :----:   | :---- |
           * |[31:0]  |EPDAT     |Endpoint A~L Data Register
           * |        |          |Endpoint A~L data buffer for the buffer transaction (read or write).
           * |        |          |Only word or byte access are supported.
        */
        __IO uint8_t  EPDAT_BYTE;

    }; ///< Define EPx Data Register 32-bit or 8-bit access
    /**
        * EPxINTSTS
        * ===================================================================================================
        * Offset: 0x68+x*0x28  Endpoint x Interrupt Status Register
        * ---------------------------------------------------------------------------------------------------
        * |Bits    |Field     |Descriptions
        * | :----: | :----:   | :---- |
        * |[0]     |BUFFULLIF |Buffer Full
        * |        |          |For an IN endpoint, the currently selected buffer is full, or no buffer is available to the local side for writing (no space to write).
        * |        |          |For an OUT endpoint, there is a buffer available on the local side, and there are FIFO full of bytes available to be read (entire packet is available for reading.
        * |        |          |0 = The endpoint packet buffer is not full.
        * |        |          |1 = The endpoint packet buffer is full.
        * |        |          |Note: This bit is read-only.
        * |[1]     |BUFEMPTYIF|Buffer Empty
        * |        |          |For an IN endpoint, a buffer is available to the local side for writing up to FIFO full of bytes.
        * |        |          |0 = The endpoint buffer is not empty.
        * |        |          |1 = The endpoint buffer is empty.
        * |        |          |For an OUT endpoint:
        * |        |          |0 = The currently selected buffer does not have a count of 0.
        * |        |          |1 = The currently selected buffer has a count of 0, or no buffer is available on the local side (nothing to read).
        * |        |          |Note: This bit is read-only.
        * |[2]     |SHORTTXIF |Short Packet Transferred Interrupt
        * |        |          |0 = The length of the last packet was not less than the Maximum Packet Size (EPMPS).
        * |        |          |1 = The length of the last packet was less than the Maximum Packet Size (EPMPS).
        * |        |          |Note: Write 1 to clear this bit to 0.
        * |[3]     |TXPKIF    |Data Packet Transmitted Interrupt
        * |        |          |0 = No data packet is transmitted from the endpoint to the host.
        * |        |          |1 = A data packet is transmitted from the endpoint to the host.
        * |        |          |Note: Write 1 to clear this bit to 0.
        * |[4]     |RXPKIF    |Data Packet Received Interrupt
        * |        |          |0 = No data packet is received from the host by the endpoint.
        * |        |          |1 = A data packet is received from the host by the endpoint.
        * |        |          |Note: Write 1 to clear this bit to 0.
        * |[5]     |OUTTKIF   |Data OUT Token Interrupt
        * |        |          |0 = A Data OUT token has not been received from the host.
        * |        |          |1 = A Data OUT token has been received from the host.
        * |        |          |This bit also set by PING token (in high-speed only.
        * |        |          |Note: Write 1 to clear this bit to 0.
        * |[6]     |INTKIF    |Data IN Token Interrupt
        * |        |          |0 = No Data IN token has been received from the host.
        * |        |          |1 = A Data IN token has been received from the host.
        * |        |          |Write 1 to clear this bit to 0.
        * |[7]     |PINGIF    |PING Token Interrupt
        * |        |          |0 = A Data PING token has not been received from the host.
        * |        |          |1 = A Data PING token has been received from the host.
        * |        |          |Write 1 to clear this bit to 0.
        * |[8]     |NAKIF     |USB NAK Sent
        * |        |          |0 = The last USB IN packet could be provided, and was acknowledged with an ACK.
        * |        |          |1 = The last USB IN packet could not be provided, and was acknowledged with a NAK.
        * |        |          |Write 1 to clear this bit to 0.
        * |[9]     |STALLIF   |USB STALL Sent
        * |        |          |0 = The last USB packet could be accepted or provided because the endpoint was stalled, and was acknowledged with a STALL.
        * |        |          |1 = The last USB packet could not be accepted or provided because the endpoint was stalled, and was acknowledged with a STALL.
        * |        |          |Write 1 to clear this bit to 0.
        * |[10]    |NYETIF    |NYET Sent
        * |        |          |0 = The space available in the RAM is sufficient to accommodate the next on coming data packet.
        * |        |          |1 = The space available in the RAM is not sufficient to accommodate the next on coming data packet.
        * |        |          |Write 1 to clear this bit to 0.
        * |[11]    |ERRIF     |ERR Sent
        * |        |          |0 = No any error in the transaction.
        * |        |          |1 = There occurs any error in the transaction.
        * |        |          |Write 1 to clear this bit to 0.
        * |[12]    |SHORTRXIF |Bulk Out Short Packet Received
        * |        |          |0 = No bulk out short packet is received.
        * |        |          |1 = Received bulk out short packet (including zero length packet).
        * |        |          |Write 1 to clear this bit to 0.
    */
    __IO uint32_t EPINTSTS;
    /**
      * EPxINTEN
      * ===================================================================================================
      * Offset: 0x6C+x*0x28   Endpoint x Interrupt Enable Register
      * ---------------------------------------------------------------------------------------------------
      * |Bits    |Field     |Descriptions
      * | :----: | :----:   | :---- |
      * |[0]     |BUFFULLIEN|Buffer Full Interrupt
      * |        |          |When set, this bit enables a local interrupt to be set when a buffer full condition is detected on the bus.
      * |        |          |0 = Buffer full interrupt Disabled.
      * |        |          |1 = Buffer full interrupt Enabled.
      * |[1]     |BUFEMPTYIEN|Buffer Empty Interrupt
      * |        |          |When set, this bit enables a local interrupt to be set when a buffer empty condition is detected on the bus.
      * |        |          |0 = Buffer empty interrupt Disabled.
      * |        |          |1 = Buffer empty interrupt Enabled.
      * |[2]     |SHORTTXIEN|Short Packet Transferred Interrupt Enable Bit
      * |        |          |When set, this bit enables a local interrupt to be set when a short data packet has been transferred to/from the host.
      * |        |          |0 = Short data packet interrupt Disabled.
      * |        |          |1 = Short data packet interrupt Enabled.
      * |[3]     |TXPKIEN   |Data Packet Transmitted Interrupt Enable Bit
      * |        |          |When set, this bit enables a local interrupt to be set when a data packet has been received from the host.
      * |        |          |0 = Data packet has been received from the host interrupt Disabled.
      * |        |          |1 = Data packet has been received from the host interrupt Enabled.
      * |[4]     |RXPKIEN   |Data Packet Received Interrupt Enable Bit
      * |        |          |When set, this bit enables a local interrupt to be set when a data packet has been transmitted to the host.
      * |        |          |0 = Data packet has been transmitted to the host interrupt Disabled.
      * |        |          |1 = Data packet has been transmitted to the host interrupt Enabled.
      * |[5]     |OUTTKIEN  |Data OUT Token Interrupt Enable Bit
      * |        |          |When set, this bit enables a local interrupt to be set when a Data OUT token has been received from the host.
      * |        |          |0 = Data OUT token interrupt Disabled.
      * |        |          |1 = Data OUT token interrupt Enabled.
      * |[6]     |INTKIEN   |Data IN Token Interrupt Enable Bit
      * |        |          |When set, this bit enables a local interrupt to be set when a Data IN token has been received from the host.
      * |        |          |0 = Data IN token interrupt Disabled.
      * |        |          |1 = Data IN token interrupt Enabled.
      * |[7]     |PINGIEN   |PING Token Interrupt Enable Bit
      * |        |          |When set, this bit enables a local interrupt to be set when a PING token has been received from the host.
      * |        |          |0 = PING token interrupt Disabled.
      * |        |          |1 = PING token interrupt Enabled.
      * |[8]     |NAKIEN    |USB NAK Sent Interrupt Enable Bit
      * |        |          |When set, this bit enables a local interrupt to be set when a NAK token is sent to the host.
      * |        |          |0 = NAK token interrupt Disabled.
      * |        |          |1 = NAK token interrupt Enabled.
      * |[9]     |STALLIEN  |USB STALL Sent Interrupt Enable Bit
      * |        |          |When set, this bit enables a local interrupt to be set when a stall token is sent to the host.
      * |        |          |0 = STALL token interrupt Disabled.
      * |        |          |1 = STALL token interrupt Enabled.
      * |[10]    |NYETIEN   |NYET Interrupt Enable Bit
      * |        |          |When set, this bit enables a local interrupt to be set whenever NYET condition occurs on the bus for this endpoint.
      * |        |          |0 = NYET condition interrupt Disabled.
      * |        |          |1 = NYET condition interrupt Enabled.
      * |[11]    |ERRIEN    |ERR Interrupt Enable Bit
      * |        |          |When set, this bit enables a local interrupt to be set whenever ERR condition occurs on the bus for this endpoint.
      * |        |          |0 = Error event interrupt Disabled.
      * |        |          |1 = Error event interrupt Enabled.
      * |[12]    |SHORTRXIEN|Bulk Out Short Packet Interrupt Enable Bit
      * |        |          |When set, this bit enables a local interrupt to be set whenever bulk out short packet occurs on the bus for this endpoint.
      * |        |          |0 = Bulk out interrupt Disabled.
      * |        |          |1 = Bulk out interrupt Enabled.
    */
    __IO uint32_t EPINTEN;
    /**
     * EPxDATCNT
     * ===================================================================================================
     * Offset: 0x70+x*0x28   Endpoint x Data Available Count Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |DATCNT    |Data Count
     * |        |          |For an IN endpoint (EPDIR(USBD_EPxCFG[3] is high.), this register returns the number of valid bytes in the IN endpoint packet buffer.
     * |        |          |For an OUT endpoint (EPDIR(USBD_EPxCFG[3] is low.), this register returns the number of received valid bytes in the Host OUT transfer.
     * |[30:16] |DMALOOP   |DMA Loop
     * |        |          |This register is the remaining DMA loop to complete. Each loop means 32-byte transfer.
    */
    __I  uint32_t EPDATCNT;

    /**
     * EPxRSPCTL
     * ===================================================================================================
     * Offset: 0x74+x*0x28  Endpoint x Response Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |FLUSH     |Buffer Flush
     * |        |          |Writing 1 to this bit causes the packet buffer to be flushed and the corresponding EP_AVAIL register to be cleared.
     * |        |          |This bit is self-cleared.
     * |        |          |This bit should always be written after a configuration even.
     * |        |          |0 = The packet buffer is not flushed.
     * |        |          |1 = The packet buffer is flushed by user.
     * |[2:1]   |MODE      |Mode Control
     * |        |          |The two bits determine the operation mode of the in-endpoint.
     * |        |          |00 = Auto-Validate Mode.
     * |        |          |01 = Manual-Validate Mode.
     * |        |          |10 = Fly Mode.
     * |        |          |11 = Reserved.
     * |        |          |Note: These bits are not valid for an out-endpoint.
     * |        |          |The auto validate mode will be activated when the reserved mode is selected.
     * |[3]     |TOGGLE    |Endpoint Toggle
     * |        |          |This bit is used to clear the endpoint data toggle bit.
     * |        |          |Reading this bit returns the current state of the endpoint data toggle bi.
     * |        |          |The local CPU may use this bit to initialize the end-point's toggle in case of reception of a Set Interface request or a Clear Feature (ep_halt) request from the host.
     * |        |          |Only when toggle bit is "1", this bit can be written into the inversed write data bit[3.
     * |        |          |0 = Do not clear the endpoint data toggle bit.
     * |        |          |1 = Clear the endpoint data toggle bit.
     * |[4]     |HALT      |Endpoint Halt
     * |        |          |This bit is used to send a STALL handshake as response to the token from the host.
     * |        |          |When an Endpoint Set Feature (ep_halt) is detected by the local CPU, it must write a '1' to this bi.
     * |        |          |0 = Do not send a STALL handshake as response to the token from the host.
     * |        |          |1 = Send a STALL handshake as response to the token from the host.
     * |[5]     |ZEROLEN   |Zero Length
     * |        |          |This bit is used to send a zero-length packet response to an IN-token.
     * |        |          |When this bit is set, a zero packet is sent to the host on reception of an IN-token.
     * |        |          |This bit gets cleared once the zero length data packet is sen.
     * |        |          |0 = A zero packet is not sent to the host on reception of an IN-token.
     * |        |          |1 = A zero packet is sent to the host on reception of an IN-token.
     * |[6]     |SHORTTXEN |Short Packet Transfer Enable Bit
     * |        |          |This bit is applicable only in case of Auto-Validate Method.
     * |        |          |This bit is set to validate any remaining data in the buffer which is not equal to the MPS of the endpoint, and happens to be the last transfer.
     * |        |          |This bit gets cleared once the data packet is sen.
     * |        |          |0 = Not validate any remaining data in the buffer which is not equal to the MPS of the endpoint.
     * |        |          |1 = Validate any remaining data in the buffer which is not equal to the MPS of the endpoint.
     * |[7]     |DISBUF    |Buffer Disable Bit
     * |        |          |This bit is used to receive unknown size OUT short packet.
     * |        |          |The received packet size is reference USBD_EPxDATCNT registe.
     * |        |          |0 = Buffer Not Disabled when Bulk-OUT short packet is received.
     * |        |          |1 = Buffer Disabled when Bulk-OUT short packet is received.
    */
    __IO uint32_t EPRSPCTL;
    /**
     * EPxMPS
     * ===================================================================================================
     * Offset: 0x78+x*0x28  Endpoint x Maximum Packet Size Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[10:0]  |EPMPS     |Endpoint Maximum Packet Size
     * |        |          |This field determines the Maximum Packet Size of the Endpoint.
    */
    __IO uint32_t EPMPS;
    /**
     * EPxTXCNT
     * ===================================================================================================
     * Offset: 0x7C+x*0x28  Endpoint x Transfer Count Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[10:0]  |TXCNT     |Endpoint Transfer Count
     * |        |          |For IN endpoints, this field determines the total number of bytes to be sent to the host in case of manual validation method.
     * |        |          |For OUT endpoints, this field has no effect.
    */
    __IO uint32_t EPTXCNT;

    /**
     * EPxCFG
     * ===================================================================================================
     * Offset: 0x80+x*0x28   Endpoint x Configuration Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |EPEN      |Endpoint Valid
     * |        |          |When set, this bit enables this endpoint.
     * |        |          |This bit has no effect on Endpoint 0, which is always enabled.
     * |        |          |0 = The endpoint Disabled.
     * |        |          |1 = The endpoint Enabled.
     * |[2:1]   |EPTYPE    |Endpoint Type
     * |        |          |This field selects the type of this endpoint. Endpoint 0 is forced to a Control type.
     * |        |          |00 = Reserved.
     * |        |          |01 = Bulk.
     * |        |          |10 = Interrupt.
     * |        |          |11 = Isochronous.
     * |[3]     |EPDIR     |Endpoint Direction
     * |        |          |0 = out-endpoint (Host OUT to Device).
     * |        |          |1 = in-endpoint (Host IN to Device).
     * |        |          |A maximum of one OUT and IN endpoint is allowed for each endpoint number.
     * |[7:4]   |EPNUM     |Endpoint Number
     * |        |          |This field selects the number of the endpoint. Valid numbers 1 to 15.
     * |        |          |Do not support two endpoints have same endpoint number.
    */
    __IO uint32_t EPCFG;
    /**
     * EPxBUFSTART
     * ===================================================================================================
     * Offset: 0x84+x*0x28  Endpoint x RAM Start Address Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[11:0]  |SADDR     |Endpoint Start Address
     * |        |          |This is the start-address of the RAM space allocated for the endpoint A~L.
    */
    __IO uint32_t EPBUFSTART;
    /**
     * EPxBUFEND
     * ===================================================================================================
     * Offset: 0x88+x*0x28  Endpoint x RAM End Address Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[11:0]  |EADDR     |Endpoint End Address
     * |        |          |This is the end-address of the RAM space allocated for the endpoint A~L.
    */
    __IO uint32_t EPBUFEND;


} USBD_EP_T;

typedef struct
{


